# INCRBY , DECRBY

<br>

## ğŸ“’ incrby

incrby ëª…ë ¹ì–´ëŠ” ë’¤ì— ì§€ì •í•œ ìˆ«ìë§Œí¼ ê°’ì„ ì¦ê°€ì‹œí‚¨ë‹¤(ì›ë˜ ê°’ì´ 10 ì¸ ê°’ì— ëŒ€í•´ incrby 20 ì„ í•  ê²½ìš° -> 30)

`incrby [key] [value]` í˜•ì‹ìœ¼ë¡œ ì‚¬ìš©í•œë‹¤.

```shell
> set a 10
> OK

> incrby a 20
> 30
```

<br>

incrby ì—ëŠ” ìŒìˆ˜ë„ ì…ë ¥ ê°€ëŠ¥í•˜ì§€ë§Œ, ì†Œìˆ˜ëŠ” ì…ë ¥ì´ ë¶ˆê°€ëŠ¥í•˜ë‹¤.

```shell
> set a 10
> OK

> incrby a -5
> 5
```

<br>

```shell
> set a 10
> OK

> incrby a 1.5
> ERR value is not an integer or out of range
```

<br>

## ğŸ“• decrby

decrby ëŠ” incrby ì™€ ë°˜ëŒ€ë¡œ ì§€ì •í•œ ë§Œí¼ ê°’ì„ ê°ì†Œì‹œí‚¨ë‹¤.

ì‚¬ìš©ë²•ì€ incrbyì™€ ë™ì¼í•˜ë‹¤.

```shell
> set a 10
> OK

> decrby a 5
> 5
```

<br>

decrby ì—ì„œ ìŒìˆ˜ ì‚¬ìš© ì‹œ ê°’ì´ ì§€ì •í•œ ë§Œí¼ ì¦ê°€í•œë‹¤.

```shell
> set a 10
> OK

> decrby a -5
> 15
```

decrby ì—­ì‹œ incrby ì™€ ë§ˆì°¬ê°€ì§€ë¡œ ì†Œìˆ˜ ì‚¬ìš©ì´ ë¶ˆê°€ëŠ¥í•˜ë‹¤.

<br>

## ì°¸ì¡°

[redis gate](http://redisgate.kr/redis/command/decrby.php)
